use [Restaurant]

INSERT INTO dbo.Restaurant_Posts (Post_Name, Salary, Responsibilities, Requirements)
VALUES
('Официант', '20000', 'Обслуживание клиентов, прием и выдача платежей', 'Хорошие навыки коммуникации, умение многозадачить'),
('Повар', '30000', 'Приготовление и готовка пищи', 'Знание кулинарных техник и ингредиентов'),
('Менеджер', '40000', 'Управление персоналом, заказ товаров, обеспечение удовлетворенности клиентов', 'Навыки лидерства, умение решать проблемы'),
('Бармен', '25000', 'Приготовление и подача напитков клиентам', 'Знание различных алкогольных и безалкогольных напитков'),
('Хост/Хостесс', '18000', 'Приветствие и размещение клиентов, управление бронированием', 'Хорошие межличностные навыки, способность работать в быстром темпе');

INSERT INTO dbo.Restaurant_Employees (Lastname, Firstname, Middlename, Age, Gender, Adress, Phone, Passport, Post_Code)
VALUES
('Иванов', 'Иван', 'Иванович', '25', 'М', 'Москва', '1234567890', '1234 567890', 2),
('Петров', 'Петр', 'Петрович', '30', 'М', 'Санкт-Петербург', '0987654321', '9876 543210', 3),
('Сидоров', 'Сергей', 'Иванович', '22', 'М', 'Казань', '1111111111', '1111 111111', 1),
('Федорова', 'Мария', 'Николаевна', '28', 'Ж', 'Екатеринбург', '2222222222', '2222 222222', 5),
('Смирнов', 'Максим', 'Андреевич', '27', 'М', 'Новосибирск', '3333333333', '3333 333333', 4),
('Кузнецова', 'Анна', 'Владимировна', '23', 'Ж', 'Нижний Новгород', '4444444444', '4444 444444', 1),
('Орлова', 'Елена', 'Сергеевна', '35', 'Ж', 'Самара', '5555555555', '5555 555555', 3),
('Морозов', 'Дмитрий', 'Александрович', '29', 'М', 'Краснодар', '6666666666', '6666 666666', 2),
('Никитин', 'Алексей', 'Дмитриевич', '26', 'М', 'Воронеж', '7777777777', '7777 777777', 4),
('Киселев', 'Игорь', 'Андреевич', '31', 'М', 'Пермь', '8888888888', '8888 888888', 5);


INSERT INTO dbo.Restaurant_Storage (Ingredient_Name, Date_of_Issue, Amount, Shelf_Life,
Cost, Supplier)
VALUES
('Говядина', '2022-01-01', '50 кг', '7 дней', 5000, 'Мясо ООО'),
('Свинина', '2022-01-02', '40 кг', '5 дней', 4000, 'Мясо ООО'),
('Курица', '2022-01-03', '30 кг', '3 дня', 3000, 'Птица ЗАО'),
('Рис', '2022-01-04', '20 кг', '1 год', 1000, 'Зерно ООО'),
('Картофель', '2022-01-05', '25 кг', '1 месяц', 1500, 'Фермерское Хозяйство'),
('Помидоры', '2022-01-06', '15 кг', '1 неделя', 2000, 'Фермерское Хозяйство'),
('Сыр', '2022-01-07', '10 кг', '1 месяц', 8000, 'Молочное ООО'),
('Салат', '2022-01-08', '5 кг', '2 дня', 500, 'Фермерское Хозяйство'),
('Лук', '2022-01-09', '7 кг', '1 месяц', 700, 'Фермерское Хозяйство'),
('Морковь', '2022-01-10', '8 кг', '1 неделя', 800, 'Фермерское Хозяйство'),
('Говядина', '2022-01-01', '50 кг', '7 дней', 5000, 'Мясо ООО'),
('Свинина', '2022-01-02', '40 кг', '5 дней', 4000, 'Мясо ООО'),
('Курица', '2022-01-03', '30 кг', '3 дня', 3000, 'Птица ЗАО'),
('Рис', '2022-01-04', '20 кг', '1 год', 1000, 'Зерно ООО'),
('Картофель', '2022-01-05', '25 кг', '1 месяц', 1500, 'Фермерское Хозяйство'),
('Помидоры', '2022-01-06', '15 кг', '1 неделя', 2000, 'Фермерское Хозяйство'),
('Сыр', '2022-01-07', '10 кг', '1 месяц', 8000, 'Молочное ООО'),
('Салат', '2022-01-08', '5 кг', '2 дня', 500, 'Фермерское Хозяйство'),
('Лук', '2022-01-09', '7 кг', '1 месяц', 700, 'Фермерское Хозяйство');


INSERT INTO dbo.Menu (Food_Name, Ingredient_Code_1, Ingredient_Amount_1, Ingredient_Code_2, Ingredient_Amount_2, Ingredient_Code_3, Ingredient_Amount_3, Cost, Cooking_time)
VALUES
('Жареная курица', 3, '200 г', 9, '50 г', 10, '50 г', 500, '20 минут'),
('Говядина по-строгановски', 1, '200 г', 4, '100 г', 8, '50 г', 700, '30 минут'),
('Свиной шницель', 2, '200 г', 5, '100 г', 9, '50 г', 600, '25 минут'),
('Овощной салат', 6, '100 г', 7, '50 г', 8, '50 г', 400, '15 минут'),
('Чизбургер', 1, '100 г', 7, '50 г', 8, '50 г', 450, '20 минут'),
('Пицца Маргарита', 4, '150 г', 6, '100 г', 7, '50 г', '550', '25 минут'),
('Салат Цезарь', 6, '100 г', 8, '50 г', 9, '50 г', 450, '15 минут'),
('Рыба с картофелем фри', 3, '200 г', 5, '100 г', 6, '100 г', 650, '30 минут'),
('Паста карбонара', 4, '150 г', 8, '50 г', 10, '50 г', 500, '20 минут'),
('Шашлык из говядины', 1, '200 г', 7, '50 г', 9, '50 г', 550, '25 минут');


INSERT INTO dbo.Ticket (Ticket_Date, Ticket_Time, Customers_Name, Phone_Number, Dish_code_1, Dish_code_2, Dish_code_3, Cost, Delivery_note, Employee_code, Completion_Date, Completion_Time)
VALUES
('2023-04-13', '19:30:00', 'Джон Смит', '1234567890', 3, 6, 7, '1550', 'Без лука', 3, '2023-04-13', '20:10:00'),
('2023-04-14', '12:00:00', 'Джейн Доу', '0987654321', 2, 5, 9, '1750', 'Дополнительный сыр', 1, '2023-04-13', '22:10:00'),
('2023-04-14', '18:45:00', 'Боб Джонсон', '5555555555', 1, 4, 8, '1650', 'Без глютена хлеб', 2, '2023-04-13', '19:10:00'),
('2023-04-14', '19:15:00', 'Эмили Браун', '1112223333', 4, 7, 9, '2000', 'Без помидоров', 3, '2023-04-14', '20:05:00'),
('2023-04-15', '13:30:00', 'Майкл Ли', '4443332222', 5, 8, 9, '2250', 'Дополнительный соус', 1, '2023-04-14', '22:30:00'),
('2023-04-15', '17:45:00', 'Саманта Вонг', '6667778888', 6, 9, 9, '2450', 'Без глютена корж', 2, '2023-04-14', '19:25:00'),
('2023-04-16', '20:00:00', 'Дэвид Ким', '9998887777', 7, 8, 1, '1800', 'Без сыра', 3, '2023-04-16', '21:00:00'),
('2023-04-17', '11:45:00', 'Мишель Чен', '5554443333', 8, 3, 2, '1950', 'Дополнительные овощи', 1, '2023-04-16', '23:30:00'),
('2023-04-17', '16:30:00', 'Крис Адамс', '9990001111', 9, 2, 3, '2100', 'Без глютена паста', 2, '2023-04-16', '18:55:00'),
('2023-04-18', '19:00:00', 'Эми Смит', '1231231234', 4, 3, 4, '2300', 'Без пепперони', 3, '2023-04-18', '20:30:00');