USE [013_Restaurant_V1_Konovalov]
INSERT INTO dbo.Restaurant_Posts
VALUES
('Повар', '15000', 'Приготовление блюд', 'Опыт работы от 2 лет'),
('Официант', '11000', 'Подача блюд', 'Вежливость'),
('Охранник', '13000', 'Охрана обьекта', 'Бдительность'),
('Менеджер', '15000', 'Помощь директору', 'Ответственность'),
('Директор', '19000', 'Следить за работой ресторана', 'Опыт работы от 2 лет');
INSERT INTO dbo.Menu
VALUES
('Стейк из свинины', '15000', 'Приготовление блюд', 'Опыт работы от 2 лет'),
INSERT INTO dbo.Restaurant_Storage
VALUES
('Свинина', '20.10.22', '1кг', '2 недели','600р','Мясокомбинат "Удачный"'),
('Говядина', '20.10.22', '2кг', '2 недели','800р','Мясокомбинат "Удачный"'),
('Курятина', '20.10.22', '1кг', '2 недели','600р','Мясокомбинат "Удачный"'),
('Яйца куриные', '20.10.22', '10шт', '4 недели','120р','Птицефабрика "Белкур"'),
('Мука', '20.10.22', '1кг', '2 недели','600р','Хлебзавод "Пшеничный"'),
('Творог', '20.10.22', '1кг', '2 недели','600р','Молокозавод "Коровка"'),
('Молоко', '20.10.22', '1л', '2 недели','600р','Молокозавод "Коровка"'),
('Сметана', '20.10.22', '1кг', '2 недели','600р','Молокозавод "Коровка"'),
('Майонез', '20.10.22', '1кг', '2 недели','600р','Молокозавод "Коровка"'),
('Кетчуп', '20.10.22', '1кг', '2 недели','600р','Молокозавод "Коровка"');


INSERT INTO dbo.Restaurant_Employees 
VALUES 
   ('Protasievich', 'Walter', 'Sobolev', '65', 'М', 'Адресс', 'Телефон', '6675_537642',1),
   ('Damirovich', 'Modest', 'Ivanov', '54', 'М', 'Адресс', 'Телефон', '6634_243243',2),
   ('Petrovich', 'Miroslav', 'Trofimov', '46', 'М', 'Адресс', 'Телефон', '6655_676767',3),
   ('Filatovich', 'Vilen', 'Kovalev', '44', 'М', 'Адресс', 'Телефон', '6767_909453',1),
   ('Vyacheslavovich', 'Anton', 'Isakov', '46', 'М', 'Адресс', 'Телефон', '6567_785865',2),
   ('Gennadievich', 'Mitrofan', 'Zykov', '35', 'М', 'Адресс', 'Телефон', '6655_889456',3),
   ('Fedorovich', 'Gennady', 'Yakushev', '31', 'М', 'Адресс', 'Телефон', '6699_343434',2),
   ('Frolovich', 'Ustin', 'Fedotov', '21', 'М', 'Адресс', 'Телефон', '6678_900098',3),
   ('Drozdov', 'Ilya', 'Yevseyevich', '89', 'М', 'Адресс', 'Телефон', '6777_898989',2),
   ('Vasilievich', 'Vilen', 'Sharov', '54', 'М', 'Адресс', 'Телефон', '6565_984578',1);
	